# TextAlignment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextAlignment Property
ParameterTypeId Class See Also
---
"Text Alignment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextAlignment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextAlignment As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextAlignment {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace